aaron-bond.better-comments
alefragnani.project-manager
astro-build.astro-vscode
charliermarsh.ruff
christian-kohler.path-intellisense
donjayamanne.githistory
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
jdinhlife.gruvbox
kevinrose.vsc-python-indent
maciejdems.add-to-gitignore
marimo-team.vscode-marimo
mhutchie.git-graph
mkhl.shfmt
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.test-adapter-converter
openai.chatgpt
pkief.material-icon-theme
redhat.vscode-yaml
ritwickdey.liveserver
rubymaniac.vscode-paste-and-indent
tamasfe.even-better-toml
tomoki1207.pdf
tyriar.sort-lines
usernamehw.errorlens
vue.volar
wayou.vscode-todo-highlight
